In [1]:
import seaborn as sns
import numpy as np
import pandas as pd
np.random.seed(42)

In [2]:
df = pd.DataFrame(np.random.randint(0,100, size=(7,5)), columns=['x1','x2','x3','x4','x5'])
df

   x1  x2  x3  x4  x5
0  51  92  14  71  60
1  20  82  86  74  74
2  87  99  23   2  21
3  52   1  87  29  37
4   1  63  59  20  32
5  75  57  21  88  48
6  90  58  41  91  59

In [3]:
df.count()

x1    7
x2    7
x3    7
x4    7
x5    7
dtype: int64

In [4]:
df.x1.count(), df.x2.count(),df.x3.count()

(7, 7, 7)

In [11]:
df.mean()

x1    53.714286
x2    64.571429
x3    47.285714
x4    53.571429
x5    47.285714
dtype: float64

In [8]:
df.mean(axis=1)

0    57.6
1    67.2
2    46.4
3    41.2
4    35.0
5    57.8
6    67.8
dtype: float64

In [6]:
df.x1.mean(), df.x2.mean(),df.x3.mean()

(53.714285714285715, 64.57142857142857, 47.285714285714285)

In [7]:
df.median()

x1    52.0
x2    63.0
x3    41.0
x4    71.0
x5    48.0
dtype: float64

In [12]:
df.min()

x1     1
x2     1
x3    14
x4     2
x5    21
dtype: int32

In [14]:
df.x1.min(), df.x2.min(), df.x3.min()

(1, 1, 14)

In [15]:
df

   x1  x2  x3  x4  x5
0  51  92  14  71  60
1  20  82  86  74  74
2  87  99  23   2  21
3  52   1  87  29  37
4   1  63  59  20  32
5  75  57  21  88  48
6  90  58  41  91  59

In [16]:
df.idxmin() #minimum un indeksini verir

x1    4
x2    3
x3    0
x4    2
x5    2
dtype: int64

In [17]:
df.x1.idxmin(),df.x2.idxmin(),df.x3.idxmin()

(4, 3, 0)

In [18]:
df.std()

x1    33.673502
x2    32.623392
x3    30.663302
x4    35.818325
x5    18.454577
dtype: float64

In [21]:
df[['x1','x2','x3']].std()

x1    33.673502
x2    32.623392
x3    30.663302
dtype: float64

In [22]:
df.var()

x1    1133.904762
x2    1064.285714
x3     940.238095
x4    1282.952381
x5     340.571429
dtype: float64

In [23]:
df[['x1','x2','x3']].var()

x1    1133.904762
x2    1064.285714
x3     940.238095
dtype: float64

In [24]:
df

   x1  x2  x3  x4  x5
0  51  92  14  71  60
1  20  82  86  74  74
2  87  99  23   2  21
3  52   1  87  29  37
4   1  63  59  20  32
5  75  57  21  88  48
6  90  58  41  91  59

In [25]:
gesamt = df.sum(axis=0)
gesamt

x1    376
x2    452
x3    331
x4    375
x5    331
dtype: int64

In [29]:
k = gesamt // 200
k

x1    1
x2    2
x3    1
x4    1
x5    1
dtype: int64

In [30]:
df.head(2)

   x1  x2  x3  x4  x5
0  51  92  14  71  60
1  20  82  86  74  74

In [31]:
df.shape, k.shape

((7, 5), (5,))

In [32]:
df.sum(axis=0)

x1    376
x2    452
x3    331
x4    375
x5    331
dtype: int64

In [33]:
df.x1.sum()

376

In [34]:
df.iloc[:,0].sum() # Spalte

376

In [35]:
df.iloc[0] # Zeile

x1    51
x2    92
x3    14
x4    71
x5    60
Name: 0, dtype: int32

In [39]:
def histogram_intersection(a, b):
    v = np.minimum(a, b).sum().round(decimals=1)
    return v
df.corr(method=histogram_intersection)

       x1     x2     x3     x4     x5
x1    1.0  275.0  172.0  268.0  237.0
x2  275.0    1.0  241.0  283.0  294.0
x3  172.0  241.0    1.0  201.0  240.0
x4  268.0  283.0  201.0    1.0  292.0
x5  237.0  294.0  240.0  292.0    1.0

In [40]:
df.corr()  # default-> pearson : standard correlation coefficient

          x1        x2        x3        x4        x5
x1  1.000000  0.041895 -0.564373  0.200385 -0.146551
x2  0.041895  1.000000 -0.562665  0.023779  0.139760
x3 -0.564373 -0.562665  1.000000 -0.158751  0.167712
x4  0.200385  0.023779 -0.158751  1.000000  0.845133
x5 -0.146551  0.139760  0.167712  0.845133  1.000000

In [41]:
df[['x1','x2','x3']].corr()

          x1        x2        x3
x1  1.000000  0.041895 -0.564373
x2  0.041895  1.000000 -0.562665
x3 -0.564373 -0.562665  1.000000

In [42]:
df.x1.corr(df.x2)

0.04189528582574875

In [43]:
df.describe()

              x1         x2         x3         x4         x5
count   7.000000   7.000000   7.000000   7.000000   7.000000
mean   53.714286  64.571429  47.285714  53.571429  47.285714
std    33.673502  32.623392  30.663302  35.818325  18.454577
min     1.000000   1.000000  14.000000   2.000000  21.000000
25%    35.500000  57.500000  22.000000  24.500000  34.500000
50%    52.000000  63.000000  41.000000  71.000000  48.000000
75%    81.000000  87.000000  72.500000  81.000000  59.500000
max    90.000000  99.000000  87.000000  91.000000  74.000000

In [44]:
df.describe().T

    count       mean        std   min   25%   50%   75%   max
x1    7.0  53.714286  33.673502   1.0  35.5  52.0  81.0  90.0
x2    7.0  64.571429  32.623392   1.0  57.5  63.0  87.0  99.0
x3    7.0  47.285714  30.663302  14.0  22.0  41.0  72.5  87.0
x4    7.0  53.571429  35.818325   2.0  24.5  71.0  81.0  91.0
x5    7.0  47.285714  18.454577  21.0  34.5  48.0  59.5  74.0

# Groupby, Aggregiation

In [47]:
df = sns.load_dataset('iris')
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [49]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [50]:
df[['sepal_length']].describe()

       sepal_length
count    150.000000
mean       5.843333
std        0.828066
min        4.300000
25%        5.100000
50%        5.800000
75%        6.400000
max        7.900000

In [51]:
df.describe()[['sepal_length']]

       sepal_length
count    150.000000
mean       5.843333
std        0.828066
min        4.300000
25%        5.100000
50%        5.800000
75%        6.400000
max        7.900000

In [52]:
df.describe().T

              count      mean       std  min  25%   50%  75%  max
sepal_length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
sepal_width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
petal_length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
petal_width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

In [57]:
df.describe(include='all')

        sepal_length  sepal_width  petal_length  petal_width species
count     150.000000   150.000000    150.000000   150.000000     150
unique           NaN          NaN           NaN          NaN       3
top              NaN          NaN           NaN          NaN  setosa
freq             NaN          NaN           NaN          NaN      50
mean        5.843333     3.057333      3.758000     1.199333     NaN
std         0.828066     0.435866      1.765298     0.762238     NaN
min         4.300000     2.000000      1.000000     0.100000     NaN
25%         5.100000     2.800000      1.600000     0.300000     NaN
50%         5.800000     3.000000      4.350000     1.300000     NaN
75%         6.400000     3.300000      5.100000     1.800000     NaN
max         7.900000     4.400000      6.900000     2.500000     NaN

In [58]:
df.corr()

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      1.000000    -0.117570      0.871754     0.817941
sepal_width      -0.117570     1.000000     -0.428440    -0.366126
petal_length      0.871754    -0.428440      1.000000     0.962865
petal_width       0.817941    -0.366126      0.962865     1.000000

In [63]:
df.corr()[['sepal_length']]

              sepal_length
sepal_length      1.000000
sepal_width      -0.117570
petal_length      0.871754
petal_width       0.817941

In [64]:
df[['sepal_length']].corr() # mantiksiz kendi kendisi

              sepal_length
sepal_length           1.0

In [68]:
df['petal_length'].corr(df['petal_width'])

0.9628654314027963

In [71]:
df.species.unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [72]:
df['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [74]:
df['species'].value_counts()

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

In [77]:
df['species'].value_counts(dropna=False, normalize=True )*100

setosa        33.333333
versicolor    33.333333
virginica     33.333333
Name: species, dtype: float64

In [78]:
df['species'].value_counts(dropna=False)*100

setosa        5000
versicolor    5000
virginica     5000
Name: species, dtype: int64

In [81]:
df['species'].value_counts(dropna=True )*100

setosa        5000
versicolor    5000
virginica     5000
Name: species, dtype: int64

In [ ]:
df['species'].value_counts(dropna=True )*100

In [86]:
df.groupby('species') #Lazy fuunktion

In [87]:
df.groupby('species').mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [88]:
df.groupby('species').median()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               5.0          3.4          1.50          0.2
versicolor           5.9          2.8          4.35          1.3
virginica            6.5          3.0          5.55          2.0

In [89]:
df.mean(numeric_only= True)

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [90]:
df.mean()

C:\Users\bulen\AppData\Local\Temp/ipykernel_7332/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [92]:
df.groupby('species').describe().T

species                setosa  versicolor  virginica
sepal_length count  50.000000   50.000000  50.000000
             mean    5.006000    5.936000   6.588000
             std     0.352490    0.516171   0.635880
             min     4.300000    4.900000   4.900000
             25%     4.800000    5.600000   6.225000
             50%     5.000000    5.900000   6.500000
             75%     5.200000    6.300000   6.900000
             max     5.800000    7.000000   7.900000
sepal_width  count  50.000000   50.000000  50.000000
             mean    3.428000    2.770000   2.974000
             std     0.379064    0.313798   0.322497
             min     2.300000    2.000000   2.200000
             25%     3.200000    2.525000   2.800000
             50%     3.400000    2.800000   3.000000
             75%     3.675000    3.000000   3.175000
             max     4.400000    3.400000   3.800000
petal_length count  50.000000   50.000000  50.000000
             mean    1.462000    4.260000   5.552000
             std     0.173664    0.469911   0.551895
             min     1.000000    3.000000   4.500000
             25%     1.400000    4.000000   5.100000
             50%     1.500000    4.350000   5.550000
             75%     1.575000    4.600000   5.875000
             max     1.900000    5.100000   6.900000
petal_width  count  50.000000   50.000000  50.000000
             mean    0.246000    1.326000   2.026000
             std     0.105386    0.197753   0.274650
             min     0.100000    1.000000   1.400000
             25%     0.200000    1.200000   1.800000
             50%     0.200000    1.300000   2.000000
             75%     0.300000    1.500000   2.300000
             max     0.600000    1.800000   2.500000

In [93]:
df.groupby('species')['sepal_length'].sum()

species
setosa        250.3
versicolor    296.8
virginica     329.4
Name: sepal_length, dtype: float64

In [94]:
df.groupby('species')['sepal_length'].mean()

species
setosa        5.006
versicolor    5.936
virginica     6.588
Name: sepal_length, dtype: float64

In [95]:
df.groupby('species')[['sepal_length']].sum()

            sepal_length
species
setosa             250.3
versicolor         296.8
virginica          329.4

In [97]:
df.groupby('species')[['sepal_length','sepal_width']].sum()

            sepal_length  sepal_width
species
setosa             250.3        171.4
versicolor         296.8        138.5
virginica          329.4        148.7

In [ ]:
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Person' :['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
        'Sales'  :[200, 120, 340, 124, 243, 350]}